// Розбір ДЗ №5

// Задача №1

// if else, prompt
// Написати програму де ми питаємо у користувача
// номер місяця і показуємо до якого часу року він належить
// Якщо користувач ввів 2 - показуєм слово Зима
// Якщо 3 -Весна і т.д.

// const monthNumber = Number(prompt("enter month number"));

// if (monthNumber === 12 || monthNumber === 1 || monthNumber === 2) {
//   console.log("Зима");
// } else if (monthNumber >= 3 && monthNumber <= 5) {
//   console.log("Весна");
// } else if (monthNumber >= 6 && monthNumber <= 8) {
//   console.log("Лето");
// } else if (monthNumber >= 9 && monthNumber <= 11) {
//   console.log("Осень");
// } else {
//   console.log("данные не валидны");
// }

// ............

// Задача №2

// Написати програму яка перевіряє логін і пароль користувача
//  і виводить привітання - якщо все добре
//  і якщо ні помилку - невінний логін

// const login = 'user@gmail.com';
// const password = '12345'

// ............

// Задача №3

/* на for
 * Напиши скрипт який підрахує суму всіх парних чисел,
 * які входят в діапазон чисел в змінних від min до max.
 * Наприклад, якщо min=0 і max=5, то діапазон 0-5,
 * зроби перевірку
 * виведи парні числа
 * і порахуй їх суму, змінна total
 * виведи консоль
 */

// const min = 0;
// const max = 5;
// let total = 0;

//..............................

// Задача №4

// Порахувати загальну суму в корзині
// const cart = [54, 28, 105, 70, 92, 17, 120];

// ...........................

// Задача №5

// Напиши скрипт який підраховує суму усіх парних чисел в масиві
// const numbers = [1, 5, 8, 9, 12, 4, 15, 27, 30, 18, 14];

// ....................
// Практика

// Задача №1
// Напиши код, який отримає масив і використовує цикл for,
// який для кожного елемента масиву буде виводити в консоль повідомлення у форматі:
/* < номер елемента > - <значення елемента >. */

//Нумерація елементів повинна починатися з 1.
// Наприклад для першого елемента масива['Mango', 'Poly', 'Ajax']
// з індексом 0 буде виведено  1 - Mango,
// а для індекса 2 выведет 3 - Ajax.

// const users = ["Mango", "Poly", "Ajax"];

// ......................

// Задача №2
// Напиши код який шукає найменше число в масиві
// const numbers = [2, 17, 94, 1, 23, 37];
